= Neo4j from JavaScript
:level: Intermediate
:toc:
:toc-placement!:
:toc-title: Overview
:toclevels: 2
:section: Develop with Neo4j

.Goals
[abstract]
If you are a JavaScript developer, you should find enough information to get you started with Neo4j.
While this guide is not comprehensive it will introduce the different Drivers and link to the relevant resources.

.Prerequisites
[abstract]
You should be familiar with link:../../what-is-neo4j/graph-database[graph database concepts] and the property graph model.
You should have link:/download[installed Neo4j] and made yourself familiar with our link:../../cypher-query-language[Cypher Query language].

[role=expertise]
{level}

toc::[]

// tag::intro[]
=== Neo4j for JavaScript Developers

image::http://dev.assets.neo4j.com.s3.amazonaws.com/wp-content/uploads/2014/04/nodejs.png[]

The standalone Neo4j-Server can be installed on any machine and then accessed via its HTTP API. 

Below we show how you can use something as simple as the `request` module to send queries to and receive responses from Neo4j.

But you can also choose to leverage one of the existing drivers for Neo4j which wrap that protocol in a more convenient API for you.
// end::intro[]

Follow the tips below to get you started.

include::../_includes/sample_project.adoc[]

=== Using the HTTP-Endpoint directly

You can use something as simple as the `request` node-module to send queries to and receive responses from Neo4j.
The endpoint protocol and formats are explained in detail in the http://docs.neo4j.org/chunked/milestone/rest-api-transactional.html[Neo4j Manual].
It enables you do to much more, e.g. sending many statments per requests or keeping transactions open across multiple requests.

Here is a simple example:

.Simple Function Accessing the Remote Endpoint
[source,javascript]
----
var r=require("request");
var txUrl = "http://localhost:7474/db/data/transaction/commit";
function cypher(query,params,cb) { 
  r.post({uri:txUrl,
          json:{statements:[{statement:query,parameters:params}]}},
         function(err,res) { cb(err,res.body)}) 
}
----

.Running the Function
[source,javascript]
---- 
var query="MATCH (n:User) RETURN n, labels(n) as l LIMIT {limit}"
var params={limit: 10}
var cb=function(err,data) { console.log(JSON.stringify(data)) }
 
cypher(query,params,cb)
 
{"results":[
  {"columns":["n","l"],
   "data":[
     {"row":[{"name":"Aran"},["User"]]}
    ]
  }],
 "errors":[]}
----

=== node-neo4j

Most widely used Node.js driver for Neo4j.

// TODO our example project

* https://github.com/aseemk/node-neo4j-template[Example Project]
* http://github.com/thingdom/node-neo4j[node-neo4j on GitHub]
* Authors: https://twitter.com/aseemk[Aseem Kishore] & Daniel Gasienica
* http://coffeedoc.info/github/thingdom/node-neo4j/[Documentation]
* https://groups.google.com/forum/#!forum/node-neo4j[google group]

=== Other Drivers

==== neo4j-js

A Node.js (pure JavaScript) client library for accessing neo4j databases with batch support.

* http://github.com/bretcope/neo4j-js[neo4j-js on GitHub]
* Author: Bret Copeland

==== node-neo4j-embedded

Node.js driver for the embedded Neo4j Database. Supports HA Setups, API is built to be as close to the Java API as possible.

* http://github.com/joewhite86/node-neo4j-embedded[node-neo4j-embedded on GitHub]
* Author: Jochen Weis