<!doctype html> <!--[if IE 9]> 
<html class="no-js ie9" lang="en">
   <![endif]--> 
   <html class="no-js" lang="en">
      <head>
         <meta charset="utf-8"/>
         <meta name="viewport" content="width=device-width, initial-scale=1.0"/>
         <link rel="shortcut icon" href="http://neo4j.com/wp-content/themes/neo4jzurb/favicon.ico"/>
         <title>Developer Resources | Neo4j Graph Database</title>
         <script type="text/javascript">
            var _kmq = _kmq || [];
            var _kmk = _kmk || 'a6a57b4b368caf34f5a6f2042eb075f9e559d779';
            function _kms(u){
                setTimeout(function(){
                    var d = document, f = d.getElementsByTagName('script')[0],
                        s = d.createElement('script');
                    s.type = 'text/javascript'; s.async = true; s.src = u;
                    f.parentNode.insertBefore(s, f);
                }, 1);
            }
            _kms('//i.kissmetrics.com/i.js');
            _kms('//doug1izaerwt3.cloudfront.net/' + _kmk + '.1.js');
         </script> <script type="text/javascript">
            (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
              (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
            m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
            })(window,document,'script','//www.google-analytics.com/analytics.js','ga');
            
            //Allow Linker 
            ga('create', 'UA-1192232-34','auto', {'allowLinker': true});
            ga('send', 'pageview');
            
            // Load the plugin.
            ga('require', 'linker');
            
            // Define which domains to autoLink.
            ga('linker:autoLink', ['neo4j.org','neo4j.com','neotechnology.com','graphdatabases.com','graphconnect.com']);
         </script> 
         <link rel="canonical" href="http://neo4j.com/guides/basic-data-modeling/"/>
         <meta property="og:locale" content="en_US"/>
         <meta property="og:type" content="article"/>
         <meta property="og:title" content="Basic Data Modeling - Neo4j Graph Database"/>
         <meta property="og:description" content="Please refer to the Neo4j Manual"/>
         <meta property="og:url" content="http://neo4j.com/guides/basic-data-modeling/"/>
         <meta property="og:site_name" content="Neo4j Graph Database"/>
         <link rel="alternate" type="application/rss+xml" title="Neo4j Graph Database &raquo; Feed" href="http://neo4j.com/feed/"/>
         <link rel="alternate" type="application/rss+xml" title="Neo4j Graph Database &raquo; Comments Feed" href="http://neo4j.com/comments/feed/"/>
         <link rel="alternate" type="application/rss+xml" title="Neo4j Graph Database &raquo; Basic Data Modeling Comments Feed" href="http://neo4j.com/guides/basic-data-modeling/feed/"/>
         <link rel='stylesheet' id='font-awesome-four-css' href="http://neo4j.com/wp-content/plugins/font-awesome-4-menus/css/font-awesome.min.css?ver=4.1.0" type='text/css' media='all'/>
         <link rel='stylesheet' id='foundation-css' href="http://neo4j.com/wp-content/themes/neo4jzurb/assets/css/app.css?ver=3.9.2" type='text/css' media='screen'/>
         <link rel='stylesheet' id='neo-codemirror-css' href="http://neo4j.com/wp-content/themes/neo4jzurb/assets/css/codemirror-neo.css?ver=3.9.2" type='text/css' media='screen'/>
         <script type='text/javascript'>
            /* <![CDATA[ */
            var ajax_object = {"ajaxurl":"http:\/\/neo4j.com\/wp-admin\/admin-ajax.php"};
            /* ]]> */
         </script> <script type='text/javascript' src='http://neo4j.com/wp-content/plugins/neo4j-download/js/download.js?ver=3.9.2'></script> <script type='text/javascript' src='http://neo4j.com/wp-content/plugins/jquery-updater/js/jquery-2.1.0.min.js?ver=2.1.0'></script> <script type='text/javascript' src='http://neo4j.com/wp-content/themes/neo4jzurb/assets/js/vendor/modernizr.min.js?ver=3.9.2'></script> <script type='text/javascript' src='http://neo4j.com/wp-content/themes/neo4jzurb/assets/js/foundation.min.js?ver=3.9.2'></script> <script type='text/javascript' src='http://neo4j.com/wp-content/themes/neo4jzurb/assets/js/vendor/codemirror.min.js?ver=3.9.2'></script> <script type='text/javascript' src='http://neo4j.com/wp-content/themes/neo4jzurb/assets/js/neo_codemirror.js?ver=3.9.2'></script> <script type='text/javascript' src='//use.typekit.net/rdt4xku.js?ver=3.9.2'></script> <script type='text/javascript' src='http://neo4j.com/wp-content/themes/neo4jzurb/assets/js/misc.js?ver=3.9.2'></script> <script type='text/javascript' src='http://neo4j.com/wp-content/themes/neo4jzurb/assets/js/neo_calculator_v3.js?ver=3.9.2'></script> 
         <link rel="EditURI" type="application/rsd+xml" title="RSD" href="http://neo4j.com/xmlrpc.php?rsd"/>
         <link rel="wlwmanifest" type="application/wlwmanifest+xml" href="http://neo4j.com/wp-includes/wlwmanifest.xml"/>
         <meta name="generator" content="WordPress 3.9.2"/>
         <link rel='shortlink' href="http://neo4j.com/?p=32079"/>
         <style type="text/css">.recentcomments a{display:inline !important;padding:0 !important;margin:0 !important;}</style>
      </head>
      <body>
         <div class="off-canvas-wrap">
            <div class="inner-wrap">
               <aside class="left-off-canvas-menu">
                  <ul class="off-canvas-list">
                     <li><a href="http://neo4j.com/use-cases/">Use Cases</a></li>
                     <li><a href="http://neo4j.com/customers/">Customers</a></li>
                     <li><a href="http://neo4j.com/community/">Community</a></li>
                     <li><a href="http://neo4j.com/docs/">Docs</a></li>
                     <li>
                        <div class="medium-3 columns headspace-20">
                           <div class="row collapse">
                              <div class="small-10 columns">
                                 <form role="search" method="get" id="searchform" class="searchform" action="http://neo4j.com/">
                                    <input type="text" name="s" id="s"/> 
                              </div>
                              <div class="small-2 columns"> <div class="button postfix"> <input type="image" id="searchsubmit" src="http://www.neo4j.com/wp-content/themes/neo4jzurb/assets/images/searchicon.png" style="vertical-align:middle;"/> </form> </div> </div> 
                           </div>
                        </div>
                     </li>
                  </ul>
               </aside>
               <div class="marquee">
                  <div class="navigation">
                     <div class="navigation-large hide-for-small">
                        <div class="row">
                           <div class="medium-9 large-7 columns nav-list">
                              <ul class="inline-list">
                                 <li><a href="http://neo4j.com/index.php"><img src="http://www.neo4j.com/wp-content/themes/neo4jzurb/assets/images/logo-neo4j.svg" class="logo" alt="neo4j"></a></li>
                                 <li class="nav-link"><a href="http://neo4j.com/use-cases/">Use Cases</a></li>
                                 <li class="nav-link"><a href="http://neo4j.com/customers/">Customers</a></li>
                                 <li class="nav-link"><a href="http://neo4j.com/community/">Community</a></li>
                                 <li class="nav-link"><a href="http://neo4j.com/docs/">Docs</a></li>
                              </ul>
                           </div>
                           <div class="medium-3 large-3 columns nav-search">
                              <div class="row collapse">
                                 <div class="small-10 columns">
                                    <form role="search" method="get" id="searchform" class="searchform" action="http://neo4j.com/">
                                       <input type="text" name="s" id="s"/> 
                                 </div>
                                 <div class="small-2 columns"> <div class="button postfix"> <input type="image" id="searchsubmit" src="http://www.neo4j.com/wp-content/themes/neo4jzurb/assets/images/searchicon.png" style="vertical-align:middle;"/> </form> </div> </div> 
                              </div>
                           </div>
                           <div class="large-2 columns show-for-large-up"> <a href="http://neo4j.com/download/" class="tiny small button right">Download</a> </div>
                        </div>
                     </div>
                     <nav class="tab-bar show-for-small">
                        <section class="left-small"> <a class="left-off-canvas-toggle menu-icon"><span></span></a> </section>
                        <section class="middle tab-bar-section"> <img src="http://www.neo4j.com/wp-content/themes/neo4jzurb/assets/images/logo-neo4j.svg" class="logo" alt="neo4j" </section>
                     </nav>
                  </div>
                  <div class="row text-center">
                     <div class="medium-10 small-centered columns">
                        <h1 class="hero-title">Developer Resources</h1>
                        <h2 class="subheader"></h2>
                     </div>
                  </div>
               </div>
               <article id="content" role="main">
                  <section class="row" style="padding:10px 0;">
                     
                  <div class="large-9 columns" style="padding-top:10px;">


<div id="content">
<div id="preamble">
<div class="sectionbody">
<div class="paragraph">
<p>This friendly guide will introduce you to the Cypher query language, which is used by Neo4j.
It was developed at Neo Technology for creating and querying graph data.</p>
</div>
<div class="paragraph">
<p>If you want to keep a reference on your side while reading, please see the <a href="http://docs.neo4j.org/refcard/{neo4j-version}">Cypher Refcard</a>.</p>
</div>
</div>
</div>
<div class="sect1">
<h2 id="_it_s_all_about_patterns">It&#8217;s all about Patterns</h2>
<div class="sectionbody">
<div class="paragraph">
<p>Graphs thrive on patterns, each graph is a connected structure which consists of many different patterns.</p>
</div>
<div class="paragraph">
<p>Patterns capture semantic information by describing how things relate.
They tell you if <em>I KNOW you</em>, <em>an_Author WROTE a Book</em>, <em>a Person LIVES at a Place</em> or <em>an Actor ACTED_IN a Movie</em>.</p>
</div>
<div class="paragraph">
<p>This kind of simple pattern typically describes how two entities are related.
Combined with other patterns, this can represent complex domains and interesting use-cases.</p>
</div>
<div class="paragraph">
<p>Small pattern structures are also easy for the human brain to handle.
We are well versed in detecting patterns not only in our daily lives but also in data, when the data is presented visually.</p>
</div>
<div class="paragraph">
<p>Cypher is all about patterns.
They are used to describe graph structures you want to create or information you want to find.</p>
</div>
</div>
</div>
<div class="sect1">
<h2 id="_cypher_concepts">Cypher Concepts</h2>
<div class="sectionbody">
<div class="paragraph">
<p>Cypher is a textual, declarative query language, much like SQL for relational databases, but for graphs.
It doesn&#8217;t instruct the database to run certain operations but instead describes the things you want to create or find.
Neo4j then figures out what&#8217;s the best way to do that.</p>
</div>
<div class="paragraph">
<p>With Cypher, you describe graph patterns (circles and arrows for nodes and relationships) that you would usually draw on a whiteboard as symbolic, textual patterns.</p>
</div>
<div class="paragraph">
<p>It uses ASCII-art to visualize the typical circles for nodes with parentheses surrounding a piece of information.</p>
</div>
<div class="paragraph">
<p>To describe a node for a  "Movie" entity with a "title" and a "released"-year we would use a textual pattern like this:</p>
</div>
<div class="listingblock">
<div class="content">
<pre>(matrix:Movie {title:"The Matrix", released:1997})</pre>
</div>
</div>

<div class="paragraph">
<p>The <code>Movie</code> label tags the otherwise untyped node as a movie and is prefixed by a colon to become a symbol: <code>:Movie</code>.
The <code>matrix</code> identifier is just a name that we use to refer to this node within the statement later on.
It is optional and only relevant in the scope of the statement; it&#8217;s not persisted.</p>
</div>
<div class="paragraph">
<p>The freely chosen properties of that node, <code>title</code> and <code>released</code> are represented as a map (you might want to call it a dictionary or javascript-object like structure).
They are listed as keys/value pairs within curly braces.</p>
</div>
<div class="paragraph">
<p>To &#8220;draw&#8221; the arrow of your pattern, you would just use the appropriate symbols, which, in the simplest case is <code>-&#8594;</code>.
If you have more information about that relationship, like a relationship type or properties on it, you can include them in square brackets.</p>
</div>
<div class="paragraph">
<p>For the movies domain, this could be the <em>ACTED_IN</em> relationship.
So a basic fact or pattern in this domain would be:</p>
</div>
<div class="listingblock">
<div class="content">
<pre>(keanu:Person:Actor {name:"Keanu Reeves"}) -[role:ACTED_IN {roles : ["Neo"]}]-&gt; (matrix:Movie {title:"The Matrix"})</pre>
</div>
</div>

<div class="paragraph">
<p>Like with node labels, the relationship-type <code>ACTED_IN</code> is added as a symbol, prefixed with a colon: <code>:ACTED_IN</code>.
As with nodes you can use identifiers, in this case <code>role</code>, to refer to the relationship in later parts of the statement.
You use the same notation for relationship properties as for node properties.
In this case we went with an array property.</p>
</div>
<div class="paragraph">
<p>You can also assign the whole pattern to an identifier which then allows you to access each of the matched paths in the graph.
This way you can for instance inspect them or use them in other expressions.</p>
</div>
<div class="listingblock">
<div class="content">
<pre>path = (:Person)-[:ACTED_IN]-&gt;(:Movie)</pre>
</div>
</div>

<div class="paragraph">
<p>This path variable would contain 2 nodes and the connecting relationship for each such pattern found or created.
There are a number of functions to access details of a path, including <code>nodes(path)</code>, <code>rels(path)</code>, and <code>length(path)</code>.</p>
</div>
</div>
</div>
<div class="sect1">
<h2 id="_clauses">Clauses</h2>
<div class="sectionbody">
<div class="paragraph">
<p>Cypher statements consist of individual <em>clauses</em> which are their building blocks.
There are clauses that can create and match patterns in the graph but also filter, project, sort or paginate results or connect/compose partial statements.
We will use Cypher clauses to compose more complex statements that express what we want to know or create.
Neo4j then figures out how to achieve that in an efficient manner.</p>
</div>
</div>
</div>
<div class="sect1">
<h2 id="_creating_data">Creating Data</h2>
<div class="sectionbody">
<div class="paragraph">
<p>We&#8217;ll start by looking into the clause(s) that allow us to create data.</p>
</div>
<div class="paragraph">
<p>To add data, we just use the patterns we already know.
By providing patterns we can specify what graph structures, labels and attributes we would like to make part of our graph.</p>
</div>
<div class="paragraph">
<p>Obviously the simplest clause is called <code>CREATE</code>.
It will just go ahead and directly create the patterns that you specify.</p>
</div>
<div class="paragraph">
<p>For the patterns we&#8217;ve looked at so far this could look like this:</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="code programlisting cm-s-neo" data-lang="cypher"><code>CREATE (:Movie {title:"The Matrix",released:1997})</code></pre>
</div>
</div>

<div class="paragraph">
<p>If we execute this statement, Cypher returns the number of changes, in this case adding 1 node, 1 label and 2 properties.</p>
</div>
<div class="paragraph">
<p>If case we also want to return the created data we can add a <code>RETURN</code> clause, which refers to the identifier we&#8217;ve assigned to our pattern elements.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="code programlisting cm-s-neo" data-lang="cypher"><code>CREATE (p:Person {name:"Keanu Reeves", born:1964})
RETURN p</code></pre>
</div>
</div>

<div class="paragraph">
<p>If we want to create more than one element, we can separate them with commas or use multiple <code>CREATE</code> statements.</p>
</div>
<div class="paragraph">
<p>We can of course also create more complex structures, like an <code>ACTED_IN</code> relationship with information about the character, or <code>DIRECTED</code> ones for the director.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="code programlisting cm-s-neo" data-lang="cypher"><code>CREATE (a:Person {name:"Tom Hanks", born:1956})-[r:ACTED_IN {roles:["Forrest"]}]-&gt;(m:Movie {title:"Forrest Gump",released:1994})
CREATE (d:Person {name:"Robert Zemeckis", born:1951})-[:DIRECTED]-&gt;(m)
RETURN a,d,r,m</code></pre>
</div>
</div>

<div class="paragraph">
<p>The movie graph sample in the Neo4j Browser is one example of a large set of <code>CREATE</code> statements that create a complete graph.</p>
</div>
<div class="paragraph">
<p>In most cases, we want to connect new data to existing structures.
This requires that we know how to find existing patterns in our graph data, which we will look at next.</p>
</div>
</div>
</div>
<div class="sect1">
<h2 id="_matching_patterns">Matching Patterns</h2>
<div class="sectionbody">
<div class="paragraph">
<p>Matching patterns is a task for the <code>MATCH</code> statement.
We pass the same patterns we&#8217;ve used so far to <code>MATCH</code> to describe what we&#8217;re looking for.
It is a similar to <em>by example</em> queries, only that our examples also include the structures.</p>
</div>
<div class="admonitionblock note">
<table>
<tr>
<td class="icon">
<div class="title">Note</div>
</td>
<td class="content">
A <code>MATCH</code> statement will search for the patterns we specify and return <strong>one row per successful pattern match</strong>.
</td>
</tr>
</table>
</div>
<div class="paragraph">
<p>To find the data we&#8217;ve created so far, we can start looking for all nodes labeled with the <code>Movie</code> label.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="code programlisting cm-s-neo" data-lang="cypher"><code>MATCH (m:Movie)
RETURN m</code></pre>
</div>
</div>

<div class="paragraph">
<p>This should show both <em>The Matrix</em> and <em>Forrest Gump</em>.</p>
</div>
<div class="paragraph">
<p>We can also look for a specific person, like <em>Keanu Reeves</em>.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="code programlisting cm-s-neo" data-lang="cypher"><code>MATCH (p:Person {name:"Keanu Reeves"})
RETURN p</code></pre>
</div>
</div>

<div class="paragraph">
<p>Note that we only provide enough information to find the nodes, not all properties are required.
In most cases you have key-properties like SSN, ISBN, emails, logins, geolocation or product codes to look for.</p>
</div>
<div class="paragraph">
<p>We can also find more interesting connections, like for instance the movies titles that <em>Tom Hanks</em> acted in and the roles he played.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="code programlisting cm-s-neo" data-lang="cypher"><code>MATCH (p:Person {name:"Tom Hanks"})-[r:ACTED_IN]-&gt;(m:Movie)
RETURN m.title, r.roles</code></pre>
</div>
</div>

<div class="paragraph">
<p>In this case we only returned the properties of the nodes and relationships that we were interested in.
You can access them everywhere via a dot notation <code>identifer.property</code>.</p>
</div>
<div class="paragraph">
<p>Of course this only lists his role as <em>Forrest</em> in <em>Forrest Gump</em> because that&#8217;s all data that we&#8217;ve added.</p>
</div>
<div class="paragraph">
<p>But now we know enough to connect new nodes to existing ones and can combine <code>MATCH</code> and <code>CREATE</code> to attach structures to the graph.</p>
</div>
</div>
</div>
<div class="sect1">
<h2 id="_attaching_structures">Attaching Structures</h2>
<div class="sectionbody">
<div class="paragraph">
<p>To extend the graph with new information, we first have to match the existing connection points and then attach the newly created nodes with relationships.
Adding <em>Cloud Atlas</em> as new movie for <em>Tom Hanks</em> could be achieved like this:</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="code programlisting cm-s-neo" data-lang="cypher"><code>MATCH (p:Person {name:"Tom Hanks"})
CREATE (m:Movie {title:"Cloud Atlas",released:2012})
CREATE (p)-[r:ACTED_IN {roles:['Zachry']} ]-&gt;(m)
RETURN p,r,m</code></pre>
</div>
</div>

<div class="paragraph">
<p>It is important to remember that we can assign identifiers to both nodes and relationships and use them later on, no matter if they were created or matched.
It is possible to attach both node and relationship in a single <code>CREATE</code> clause.
For readability it helps to split them up though.</p>
</div>
<div class="paragraph">
<p>A tricky aspect of the combination of <code>MATCH</code> and <code>CREATE</code> is that we get one row per matched pattern.
This causes subsequent create statements to be executed for each row.
In many cases that is what you want.
If that&#8217;s not intended, please move the create statement before the <code>MATCH</code>, change the cardinality of the query with means discussed later or use the <em>get or create</em> semantics of the next clause: <code>MERGE</code>.</p>
</div>
</div>
</div>
<div class="sect1">
<h2 id="_completing_patterns">Completing Patterns</h2>
<div class="sectionbody">
<div class="paragraph">
<p>Whenever we get data from external systems or are not sure if certain information already exists in the graph, we want to be able to express a repeatable (idempotent) update operation.
In Cypher <code>MERGE</code> has this function.
It acts like a combination of <code>MATCH</code> <em>or</em> <code>CREATE</code>, that checks for the existence of data first before creating it.
Again: you specify a pattern with <code>MERGE</code> to be found or created.
Usually, as with <code>MATCH</code> you only want to include the key property to look for in your core pattern.
<code>MERGE</code> allows you to provide additional properties you want to set <code>ON CREATE</code>.</p>
</div>
<div class="paragraph">
<p>If we wouldn&#8217;t know if our graph already contained <em>Cloud Atlas</em> we could merge it in again.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="code programlisting cm-s-neo" data-lang="cypher"><code>MERGE (m:Movie {title:"Cloud Atlas"}) ON CREATE SET m.released = 2012
RETURN m</code></pre>
</div>
</div>

<div class="paragraph">
<p>In any case we get a result, either the data (potentially more than one row) that was already in the graph or a single, newly created <code>Movie</code> node.</p>
</div>
<div class="paragraph">
<p>So foremost <code>MERGE</code> makes sure that you can&#8217;t create duplicate information or structures, but it comes with the cost of needing to check first for existing matches.
Especially on large graphs it can be costly to scan a large set of labeled nodes for a certain property.
You can alleviate some of that by creating supporting indexes or constraints, which we&#8217;ll discuss later.
But it&#8217;s not for free, so whenever you&#8217;re sure to not create duplicate data use <code>CREATE</code> over <code>MERGE</code></p>
</div>
<div class="paragraph">
<p><code>MERGE</code> can also assert that a relationship is only created once.
For that to work you <strong>have to pass in</strong> both nodes from a previous pattern match.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="code programlisting cm-s-neo" data-lang="cypher"><code>MATCH (m:Movie {title:"Cloud Atlas"})
MATCH (p:Person {name:"Tom Hanks"})
MERGE (p)-[r:ACTED_IN]-&gt;(m) ON CREATE SET r.roles = ['Zachry']
RETURN p,r,m</code></pre>
</div>
</div>

<div class="paragraph">
<p>In case the direction of your relationship is arbitrary, you can leave off the arrow tip.
<code>MERGE</code> will then check for the relationship in either direction, and if not found create a new, directed relationship.</p>
</div>
<div class="paragraph">
<p>If you choose to pass in only one node externally, <code>MERGE</code> offers an interesting functionality.
It will then only match within the direct neighborhood of the provided node for the given pattern, and, if not found create it.
This can come in very handy for creating tree structures.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="code programlisting cm-s-neo" data-lang="cypher"><code>CREATE (y:Year {year:2014})
MERGE (y)&lt;-[:IN_YEAR]-(m10:Month {month:10})
MERGE (y)&lt;-[:IN_YEAR]-(m11:Month {month:11})
RETURN y,m10,m11</code></pre>
</div>
</div>

<div class="paragraph">
<p>Here the two months are not checked against globally but only in the context of the year <em>2014</em>.</p>
</div>
</div>
</div>
<div class="sect1">
<h2 id="_filtering_results">Filtering Results</h2>
<div class="sectionbody">
<div class="paragraph">
<p>So far we&#8217;ve matched patterns in the graph and always returned all results we found.
Quite often there are conditions in play for what we want to see.
Similarly to <em>SQL</em> those filter conditions are expressed in a <code>WHERE</code> clause.
This clause allows to use any number of boolean expressions (predicates) combined with <code>AND</code>, <code>OR</code> and <code>NOT</code>.
The simplest predicates are comparisons, especially equality.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="code programlisting cm-s-neo" data-lang="cypher"><code>MATCH (m:Movie)
WHERE m.title = "The Matrix"
RETURN m</code></pre>
</div>
</div>

<div class="paragraph">
<p>More interesting are numeric comparisons, matching regular expressions and checking the existence of values within a collection.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="code programlisting cm-s-neo" data-lang="cypher"><code>MATCH (p:Person)-[r:ACTED_IN]-&gt;(m:Movie)
WHERE p.name =~ "K.+"
   OR m.released &gt; 2000
   OR "Neo" IN r.roles
RETURN p,r,m</code></pre>
</div>
</div>

<div class="paragraph">
<p>One aspect that might be little surprising is that you can even use patterns as predicates.
Where <code>MATCH</code> expands the number and shape of patterns matched, a pattern predicate restricts the current result set again, only allowing the paths to pass that satisfy these additional patterns as well (or <code>NOT</code>).</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="code programlisting cm-s-neo" data-lang="cypher"><code>MATCH (p:Person)-[:ACTED_IN]-&gt;(m)
WHERE NOT (p)-[:DIRECTED]-&gt;()
RETURN p,m</code></pre>
</div>
</div>

<div class="paragraph">
<p>Here we find actors, because they sport an <code>ACTED_IN</code> relationship but then skip those that ever <code>DIRECTED</code> any movie.</p>
</div>
<div class="paragraph">
<p>There are also more advanced ways of filtering like collection-predicates which we will look at later on.</p>
</div>
</div>
</div>
<div class="sect1">
<h2 id="_returning_results">Returning Results</h2>
<div class="sectionbody">
<div class="paragraph">
<p>So far we&#8217;ve returned only nodes, relationships, or paths directly via their identifiers.
But the <code>RETURN</code> clause can actually return any number of expressions.
But what are actually expressions in Cypher?</p>
</div>
<div class="paragraph">
<p>The simplest expressions are literal values like numbers, strings and arrays as <code>[1,2,3]</code>, and maps like <code>{name:"Tom Hanks",born:1964, movies:["Forrest Gump", &#8230;], count:13}</code>.
You can access individual properties of any node, relationship, or map with a dot-syntax like <code>n.name</code>.
Individual elements or slices of arrays can be retrieved with subscripts like <code>names[0]</code> or <code>movies[1..-1]</code>.
Each function evaluation like <code>length(array)</code>, <code>toInt("12")</code>, <code>substring("2014-07-01",0,4)</code>, or <code>coalesce(p.nickname,"n/a")</code> is also an expression.</p>
</div>
<div class="paragraph">
<p>Predicates that you&#8217;d use in <code>WHERE</code> count as boolean expressions.</p>
</div>
<div class="paragraph">
<p>Of course simpler expressions can be composed and concatenated to form more complex expressions.</p>
</div>
<div class="paragraph">
<p>By default the expression itself will be used as label for the column, in many cases you want to alias that with a more understandable name using <code>expression AS alias</code>.
You can later on refer to that column using its alias.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="code programlisting cm-s-neo" data-lang="cypher"><code>MATCH (p:Person)
RETURN p, p.name AS name, upper(p.name), coalesce(p.nickname,"n/a") AS nickname, {name: p.name, label:head(labels(p))} AS person</code></pre>
</div>
</div>

<div class="paragraph">
<p>If you&#8217;re interested in unique results you can use the <code>DISTINCT</code> keyword after <code>RETURN</code> to indicate that.</p>
</div>
</div>
</div>
<div class="sect1">
<h2 id="_aggregating_information">Aggregating Information</h2>
<div class="sectionbody">
<div class="paragraph">
<p>In many cases you want to aggregate or group the data that you encounter while traversing patterns in your graph.
In Cypher aggregation happens in the <code>RETURN</code> clause while computing your final results.
Many common aggregation functions are supported, e.g. <code>count</code>, <code>sum</code>, <code>avg</code>, <code>min</code>, and <code>max</code>, but there are several more.</p>
</div>
<div class="paragraph">
<p>Counting the number of people in your database could be achieved by this:</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="code programlisting cm-s-neo" data-lang="cypher"><code>MATCH (:Person)
RETURN count(*) as people</code></pre>
</div>
</div>

<div class="paragraph">
<p>Please note that <code>NULL</code> values are skipped during aggregation.
For aggregating only unique values use <code>DISTINCT</code>, like in <code>count(DISTINCT role)</code>.</p>
</div>
<div class="paragraph">
<p>Aggregation in Cypher just works.
You specify which result columns you want to aggregate and <em>Cypher will use all non-aggregated columns as grouping keys</em>.</p>
</div>
<div class="paragraph">
<p>Aggregation affects which data is still visible in ordering or later query parts.</p>
</div>
<div class="paragraph">
<p>To find out how often an actor and director worked together, you&#8217;d run this statement:</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="code programlisting cm-s-neo" data-lang="cypher"><code>MATCH (actor:Person)-[:ACTED_IN]-&gt;(movie:Movie)&lt;-[:DIRECTED]-(director:Person)
RETURN actor,director,count(*) as collaborations</code></pre>
</div>
</div>

<div class="paragraph">
<p>Frequently you want to sort and paginate after aggregating a <code>count(x)</code>.</p>
</div>
</div>
</div>
<div class="sect1">
<h2 id="_ordering_and_pagination">Ordering and Pagination</h2>
<div class="sectionbody">
<div class="paragraph">
<p>Ordering works like in other query languages, with an <code>ORDER BY expression [ASC|DESC]</code> clause.
The expression can be any expression discussed before as long as it is computable from the returned information.</p>
</div>
<div class="paragraph">
<p>So for instance if you return <code>person.name</code> you can still <code>ORDER BY person.age</code> as both are accessible from the <code>person</code> reference.
You cannot order by things that you can&#8217;t infer from the information you return.
This is especially important with aggregation and <code>DISTINCT</code> return values as both remove the visibility of data that is aggregated.</p>
</div>
<div class="paragraph">
<p>Pagination is a straightforward use of <code>SKIP {offset} LIMIT {count}</code>.</p>
</div>
<div class="paragraph">
<p>A common pattern is to aggregate for a count (score or frequency), order by it and only return the top-n entries.</p>
</div>
<div class="paragraph">
<p>For instance to find the most prolific actors you could do:</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="code programlisting cm-s-neo" data-lang="cypher"><code>MATCH (a:Person)-[:ACTED_IN]-&gt;(m:Movie)
RETURN a,count(*) as appearances
ORDER BY appearances DESC
LIMIT 10;</code></pre>
</div>
</div>

</div>
</div>
<div class="sect1">
<h2 id="_collecting_aggregation">Collecting Aggregation</h2>
<div class="sectionbody">
<div class="paragraph">
<p>The most helpful aggregation function is <code>collect</code>, which, as the name says, collects all aggregated values into a <em>real</em> array or list.
This comes very handy in many situations as you don&#8217;t loose the detail information while aggregating.</p>
</div>
<div class="paragraph">
<p>Collect is well suited for retrieving the typical parent-child structures, where one core entity (parent, root or head) is returned per row with all it&#8217;s dependent information in associated collections created with <code>collect</code>.
This means there&#8217;s no need to repeat the parent information per each child-row or even running 1+n statements to retrieve the parent and its children individually.</p>
</div>
<div class="paragraph">
<p>To retrieve the cast of each movie in our database you could use this statement:</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="code programlisting cm-s-neo" data-lang="cypher"><code>MATCH (m:Movie)&lt;-[:ACTED_IN]-(a:Person)
RETURN m.title as movie, collect(a.name) as cast, count(*) as actors</code></pre>
</div>
</div>

<div class="paragraph">
<p>The lists created by collect can either be used from the client consuming the Cypher results or directly within a statement with any of the collection functions or predicates.</p>
</div>
</div>
</div>
<div class="sect1">
<h2 id="_building_larger_statements">Building Larger Statements</h2>
<div class="sectionbody">
<div class="sect2">
<h3 id="_combining_statements_with_union">Combining statements with UNION</h3>
<div class="paragraph">
<p>A Cypher statement is usually quite compact.
Expressing references between nodes as visual patterns makes them easy to understand.</p>
</div>
<div class="paragraph">
<p>If you want to combine the results of two statements that have the same result structure, you can use <code>UNION [ALL]</code>.</p>
</div>
<div class="paragraph">
<p>For instance if you want to list both actors and directors without using the alternative relationship-type syntax <code>()-[:ACTED_IN|:DIRECTED]&#8594;()</code> you can do this:</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="code programlisting cm-s-neo" data-lang="cypher"><code>MATCH (p:Person)-[r:ACTED_IN]-&gt;(m:Movie)
RETURN p,type(r) as rel,m
UNION
MATCH (p:Person)-[r:DIRECTED]-&gt;(m:Movie)
RETURN p,type(r) as rel,m</code></pre>
</div>
</div>

</div>
<div class="sect2">
<h3 id="_use_with_to_chain_statements">Use WITH to chain statements</h3>
<div class="paragraph">
<p>In Cypher it&#8217;s possible to chain fragments of statements together, much like you would do within a data-flow pipeline.
Each fragment works on the output from the previous one and its results can feed into the next one.</p>
</div>
<div class="paragraph">
<p>You use the <code>WITH</code> clause to combine the individual parts and declare which data flows from one to the other.
<code>WITH</code> is very much like <code>RETURN</code> with the difference that it doesn&#8217;t finish a query but prepares the input for the next part.
You can use the same expressions, aggregations, ordering and pagination as in the <code>RETURN</code> clause.</p>
</div>
<div class="paragraph">
<p>The only difference is that you <em>have to</em> alias all columns as they would otherwise not be accessible with an identifier.
Every column that you don&#8217;t declare in your <code>WITH</code> clause is not available in subsequent query parts.</p>
</div>
</div>
</div>
</div>
<div class="sect1">
<h2 id="_utilizing_data_structures">Utilizing data structures</h2>
<div class="sectionbody">
<div class="paragraph">
<p>Cypher can create and consume more complex data structures out of the box.
As already mentioned you can create literal lists (<code>[1,2,3]</code>) and maps (<code>{name: value}</code>) within a statement.</p>
</div>
<div class="paragraph">
<p>There is a number of functions that work with lists, from simple ones like <code>length(list)</code> that returns the size of a list to</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="code programlisting cm-s-neo" data-lang="cypher"><code>MATCH (m:Movie)&lt;-[:ACTED_IN]-(a:Person)
RETURN m.title as movie, collect(a.name)[0..5] as five_of_cast</code></pre>
</div>
</div>

<div class="paragraph">
<p>You can also access individual elements or slices of a list quickly with <code>list[1]</code> or <code>list[5..-5]</code>.
Other functions to access parts of a list are <code>head(list)</code>, <code>tail(list)</code> and <code>last(list)</code>.</p>
</div>
<div class="sect2">
<h3 id="_list_predicates">List predicates</h3>
<div class="paragraph">
<p>When using lists and arrays in comparisons you can use predicates like <code>value IN list</code> or <code>any(x IN list WHERE x = value)</code>.
There are list predicates to satisfy conditions for <code>all</code>, <code>any</code>, <code>none</code> and <code>single</code> elements.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="code programlisting cm-s-neo" data-lang="cypher"><code>MATCH path = (:Person)--&gt;(:Movie)&lt;--(:Person)
WHERE all(r in rels(path) WHERE type(r) = 'ACTED_IN')
AND any(n in nodes(path) WHERE n.name = 'Clint Eastwood')
RETURN path</code></pre>
</div>
</div>

</div>
<div class="sect2">
<h3 id="_list_processing">List processing</h3>
<div class="paragraph">
<p>Oftentimes you want to process lists to <code>filter</code>, aggregate (<code>reduce</code>) or transform (<code>extract</code>) their values.
Those transformations can be done within Cypher or in the calling code.
This kind of list-processing can reduce the amount of data handled and returned, so it might make sense to do it within the Cypher statement.</p>
</div>
<div class="paragraph">
<p>A simple, non-graph example would be:</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="code programlisting cm-s-neo" data-lang="cypher"><code>WITH range(1,10) as numbers
WITH extract(n in numbers | n*n) as squares
WITH filter(n in squares WHERE n &gt; 25) as large_squares
RETURN reduce( a = 0, n in large_squares | a + n ) as sum_large_squares</code></pre>
</div>
</div>

<div class="paragraph">
<p>In a graph-query you can filter or aggregate collected values instead or work on array properties.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="code programlisting cm-s-neo" data-lang="cypher"><code>MATCH (m:Movie)&lt;-[r:ACTED_IN]-(a:Person)
WITH m.title as movie, collect({name: a.name, roles: r.roles}) as cast
RETURN movie, extract(c2 IN filter(c1 IN cast WHERE c1.name =~ "A.*") | c2.roles )</code></pre>
</div>
</div>

<div class="paragraph">
<p>Cypher offers to create and consume more complex data structures out of the box.
As already mentioned you can create literal lists (<code>[1,2,3]</code>) and maps (<code>{name: value}</code>) within your statement.</p>
</div>
<div class="paragraph">
<p>There is a number of functions to work with lists, from simple ones like <code>length(list)</code> that returns the size of a list to</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="code programlisting cm-s-neo" data-lang="cypher"><code>MATCH (m:Movie)&lt;-[:ACTED_IN]-(a:Person)
RETURN m.title as movie, collect(a.name)[0..5] as five_of_cast</code></pre>
</div>
</div>

<div class="paragraph">
<p>You can also access individual elements or slices of a list quickly with <code>list[1]</code> or <code>list[5..-5]</code>.
Other functions to access parts of a list are <code>head(list)</code>, <code>tail(list)</code> and <code>last(list)</code>.</p>
</div>
</div>
<div class="sect2">
<h3 id="_unwind">UNWIND</h3>
<div class="paragraph">
<p>Sometimes you have collected information into a list, but want to use each element individually as a row.
For instance, you might want to further match patterns in the graph.
Or you passed in a collection of values but now want to create or match a node or relationship for each element.
Then you can use the <code>UNWIND</code> clause to unroll a list into a sequence of rows again.</p>
</div>
<div class="paragraph">
<p>For instance, a query to find the top 5-co-actors and then follow their movies and again list the cast for each of those movies:</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="code programlisting cm-s-neo" data-lang="cypher"><code>MATCH (a:Person)-[:ACTED_IN]-&gt;(m:Movie)&lt;-[:ACTED_IN]-(colleague:Person)
WITH colleague, count(*) as frequency, collect(distinct m) as movies
ORDER BY frequency DESC
LIMIT 5
UNWIND movies as m
MATCH (m)&lt;-[:ACTED_IN]-(a)
RETURN m.title as movie, collect(a.name) as cast</code></pre>
</div>
</div>

</div>
</div>
</div>
<div class="sect1">
<h2 id="_indexes_and_constraints">Indexes and Constraints</h2>
<div class="sectionbody">
<div class="paragraph">
<p>Labels allow you to group nodes, and add indexes or constraints to them.
Adding an index gives fast lookups for starting nodes in the graph.</p>
</div>
<div class="sect2">
<h3 id="_lookup_indexes">Lookup Indexes</h3>
<div class="paragraph">
<p>In general, for a graph query to run fast, you don&#8217;t need indexes, you only need them to find your starting points.
After that initial lookups you rely on the in-graph structures and first class citizenship of relationships in the graph database to achieve high performance.</p>
</div>
<div class="paragraph">
<p>You would create an index like this: <code>CREATE INDEX ON :Movie(title)</code></p>
</div>
</div>
<div class="sect2">
<h3 id="_unique_constraints">Unique Constraints</h3>
<div class="paragraph">
<p>You can also specify unique constraints that guarantee uniqueness of a certain property on nodes with a specific label.</p>
</div>
<div class="paragraph">
<p>These constraints are also used by the <code>MERGE</code> clause to make certain that a node only exists once.</p>
</div>
<div class="paragraph">
<p>A constraint definition would look like this: <code>CREATE CONSTRAINT ON (p:Person) ASSERT p.name IS UNIQUE</code>.</p>
</div>
</div>
</div>
</div>
<div class="sect1">
<h2 id="_loading_data">Loading Data</h2>
<div class="sectionbody">
<div class="paragraph">
<p>As you&#8217;ve seen you can not only query data expressively but also create data with Cypher statements.</p>
</div>
<div class="paragraph">
<p>Naturally in most cases you wouldn&#8217;t want to write or generate huge statements to generate your data but instead use an existing data source that you pass into your statement and which is used to drive the graph generation process.</p>
</div>
<div class="paragraph">
<p>That process not only includes creating completely new data but also integrating with existing structures and updating your graph.</p>
</div>
<div class="sect2">
<h3 id="_parameters">Parameters</h3>
<div class="paragraph">
<p>In general we recommend passing in varying literal values from the outside as named parameters.</p>
</div>
<div class="paragraph">
<p>This allows Cypher to reuse existing execution plans for the statements.</p>
</div>
<div class="paragraph">
<p>Of course you can also pass in parameters for data to be imported.
Those can be scalar values, maps, lists or even lists of maps.</p>
</div>
<div class="paragraph">
<p>In your Cypher statement you can then iterate over those values (e.g. with <code>UNWIND</code>) to create your graph structures.</p>
</div>
<div class="paragraph">
<p>For instance to create a movie graph from JSON data structures pulled from an API you could use:</p>
</div>
<div class="listingblock">
<div class="content">
<pre>[{title:"Stardust", released:2007, cast: [{actor:{name:"Robert de Niro",born:1943},characters:["Captain Shakespeare"]},
                                          {actor:{name:"Michelle Pfeiffer",born:1958},characters:["Lamia"]}]}
,...
]</pre>
</div>
</div>

<div class="listingblock">
<div class="content">
<pre class="code programlisting cm-s-neo" data-lang="cypher"><code>UNWIND {movies} as movie
MERGE (m:Movie {title:movie.title}) ON CREATE SET m.released = movie.released
FOREACH (role IN movie.cast |
   MERGE (a:Person {name:role.actor.name}) ON CREATE SET a.born = role.actor.born
   MERGE (a)-[:ACTED_IN {roles:role.characters}]-&gt;(m)
)</code></pre>
</div>
</div>

</div>
</div>
</div>
<div class="sect1">
<h2 id="_importing_csv">Importing CSV</h2>
<div class="sectionbody">
<div class="paragraph">
<p>Cypher provides an elegant built-in way to import tabular CSV data into more complex graph structures.</p>
</div>
<div class="paragraph">
<p>The <code>LOAD CSV</code> clause parses a local or remote file into a stream of rows which represent maps (with headers) or lists.
Then you can use whatever Cypher operations you want to apply to either create nodes or relationships or to merge with existing graph structures.</p>
</div>
<div class="paragraph">
<p>As CSV files usually represent either node- or relationship-lists, you run multiple passes to create nodes and relationships separately.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="code programlisting cm-s-neo" data-lang="cypher"><code>LOAD CSV WITH HEADERS FROM "http://docs.neo4j.org/chunked/stable/csv/import/movies.csv" AS line
CREATE (m:Movie {id:line.id,title:line.title, released:toInt(line.year)});

LOAD CSV WITH HEADERS FROM "http://docs.neo4j.org/chunked/stable/csv/import/persons.csv" AS line
MERGE (a:Person {id:line.id}) ON CREATE SET a.name=line.name;

LOAD CSV WITH HEADERS FROM "http://docs.neo4j.org/chunked/stable/csv/import/roles.csv" AS line
MATCH (m:Movie {id:line.movieId})
MATCH (a:Person {id:line.personId})
CREATE (a)-[:ACTED_IN {roles:[line.role]}]-&gt;(m);</code></pre>
</div>
</div>

<div class="paragraph">
<p>If your file contains denormalized data, you can either run the same file with multiple passes and simple operations as shown above or you might have to use MERGE to create entities uniquely.</p>
</div>
<div class="paragraph">
<p>For our use-case we can import the data using a CSV structure like this:</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="code programlisting cm-s-neo" data-lang="csv"><code>title;released;actor;born;characters
Back to the Future;1985;Michael J. Fox;1961;Marty McFly
Back to the Future;1985;Christopher Lloyd;1938;Dr. Emmet Brown
...</code></pre>
</div>
</div>

<div class="listingblock">
<div class="content">
<pre class="code programlisting cm-s-neo" data-lang="cypher"><code>LOAD CSV WITH HEADERS FROM "http://server/movie_actor_roles.csv" AS line FIELDTERMINATOR ";"
MERGE (m:Movie {title:line.title}) ON CREATE SET m.released = toInt(line.released)
MERGE (a:Person {name:line.actor}) ON CREATE SET a.born = toInt(line.born)
MERGE (a)-[:ACTED_IN {roles:split(line.characters,",") }]-&gt;(m)</code></pre>
</div>
</div>

<div class="paragraph">
<p>If you import a large amount of data (more than 10000 rows), it is recommended to prefix your <code>LOAD CSV</code> clause with a <code>PERIODIC COMMIT</code> hint,
which allows Cypher to regularly commit the import transactions to avoid memory churn for large transaction-states.</p>
</div>
</div>
</div>
<div class="sect1">
<h2 id="_programmatic_use">Programmatic Use</h2>
<div class="sectionbody">
<div class="paragraph">
<p>The most direct way to use Cypher programmatically is to execute a HTTP-POST operation against the transactional Cypher endpoint.
With each request you can send a large number of statements with parameters to the server.
For immediate execution you can use the <code>/db/data/transaction/commit</code> endpoint with a JSON payload like this:</p>
</div>
<div class="listingblock">
<div class="content">
<pre>curl -i -H accept:application/json -H content-type:application/json -XPOST http://localhost:7474/db/data/transaction/commit \
  -d '{"statements":[{"statement":"CREATE (p:Person {name:{name},born:{born}}) RETURN p","parameters":{"name":"Keanu Reeves","born":1964}}]}'

# results
{"results":[{"columns":["p"],"data":[{"row":[{"name":"Keanu Reeves","born":1964}]}]}],"errors":[]}</pre>
</div>
</div>

<div class="paragraph">
<p>In the payload you can add as many "statement" objects in the "statements" list.</p>
</div>
<div class="paragraph">
<p>For larger use-cases that span multiple requests but whose read-write-read-write operations should be executed within the same transactional scope you&#8217;d use the
endpoint <code>/db/data/transaction</code> and would get a transaction URL as the <code>Location</code>-Header that you can continue to write to and read from.
At the end you either commit the whole transaction by POSTing to the (also returned) commit URL or by issuing a DELETE request against your transactional endpoint.</p>
</div>
<div class="listingblock">
<div class="content">
<pre>curl -i -H accept:application/json -H content-type:application/json -XPOST http://localhost:7474/db/data/transaction \
  -d '{"statements":[{"statement":"CREATE (p:Person {name:{name},born:{born}}) RETURN p","parameters":{"name":"Clint Eastwood","born":1930}}]}'

# results
HTTP/1.1 201 Created
Location: http://localhost:7474/db/data/transaction/261

{"commit":"http://localhost:7474/db/data/transaction/261/commit","transaction":{"expires":"Wed, 03 Sep 2014 23:26:51 +0000"},"errors":[],
 "results":[{"columns":["p"],"data":[{"row":[{"name":"Clint Eastwood","born":1930}]}]}]}</pre>
</div>
</div>

</div>
</div></div>

</div>
</section>
               <div class="row text-center hide-for-small hr-style">
                  <div class="medium-5 columns">
                     <hr>
                  </div>
                  <div class="medium-2 columns"> <object height="100%" width="100%" data="http://www.neo4j.com/wp-content/themes/neo4jzurb/assets/images/hr-image.svg" type="image/svg+xml"></object> </div>
                  <div class="medium-5 columns">
                     <hr>
                  </div>
               </div>
               <div class="row text-center show-for-small">
                  <div class="medium-12 columns">
                     <hr>
                  </div>
               </div>

            </article>
            <div class="calloutsection">
               <div class="row">
                  <div class="medium-8 small-centered columns text-center">
                     <h3>Stay Connected</h3>
                     <p>Sign up to find out more about Neo4j's upcoming events &amp; meetups.</p>
                  </div>
               </div>
               <div class="row">
                  <div class="medium-6 small-centered columns">
                     <div class="row collapse">
                        <div class="small-8 columns">
                           <script src="//app-sjl.marketo.com/js/forms2/js/forms2.js"></script> 
                           <form id="mktoForm_519"></form>
                           <script>MktoForms2.loadForm("//app-sjl.marketo.com", "773-GON-065", 519);</script> 
                        </div>
                        <div class="small-4 columns"> <a href="#" id="signupbody" class="button postfix">Keep Me Connected &rsaquo;</a> </div>
                     </div>
                  </div>
               </div>
            </div>
            <style> .mktoButtonWrap {display:none;} </style>
            <script>
               var btn = document.getElementById("signupbody");
               btn.onclick = function(){
               MktoForms2.getForm(519).submit();
               };
            </script> 
            <div class="row text-center hide-for-small hr-style">
               <div class="medium-5 columns">
                  <hr>
               </div>
               <div class="medium-2 columns"> <object height="100%" width="100%" data="http://www.neo4j.com/wp-content/themes/neo4jzurb/assets/images/hr-image.svg" type="image/svg+xml"></object> </div>
               <div class="medium-5 columns">
                  <hr>
               </div>
            </div>
            <div class="row text-center show-for-small">
               <div class="medium-12 columns">
                  <hr>
               </div>
            </div>
            <footer id="footer">
               <div class="row">
                  <div class="small-6 medium-3 columns">
                     <h5>Learn & Try</h5>
                     <ul>
                        <li><a href="../about-neo4j">About Neo4j</a></li>
                        <li><a href="../graph-concepts/">Graph Concepts</a></li>
                        <li><a href="http://neo4j.com/use-cases/">Use Cases</a></li>
                        <li><a href="http://neo4j.com/customers/">Our Customers</a></li>
                        <li><a href="http://neo4j.com/download/">Download Neo4j</a></li>
                        <li><a href="http://console.neo4j.org/">Live Neo4j Console</a></li>
                        <li><a href="../neo4j-browser/">Neo4j Browser</a></li>
                        <li><a href="http://gist.neo4j.org/">Graph Gists</a></li>
                     </ul>
                  </div>
                  <div class="small-6 medium-3 columns">
                     <h5>Develop</h5>
                     <ul>
                        <li><a href="http://neo4j.com/docs/">Docs</a></li>
                        <li><a href="../">Neo4j Guides</a></li>
                        <li><a href="../data-import/">Import Data</a></li>
                        <li><a href="http://neo4j.com/contrib/">Select a Driver</a></li>
                        <li><a href="../basic-cypher/">Cypher Query Language</a></li>
                        <li><a href="./">Data Modeling</a></li>
                     </ul>
                  </div>
                  <div class="small-6 medium-3 columns">
                     <h5>Connect with Neo4j</h5>
                     <ul>
                        <li><a href="http://neo4j.com/training/">Training</a></li>
                        <li><a href="http://neo4j.com/events/">Events</a></li>
                        <li><a href="http://neo4j.com/blog/">Blog</a></li>
                        <li><a href="http://neo4j.com/community/#support">Support</a></li>
                        <li><a href="http://neo4j.com/neo4j-partner-program/">Neo4j Partner Program</a></li>
                        <li><a href="http://neotechnology.com/about/">About Neo Technology</a></li>
                     </ul>
                  </div>
                  <div class="small-12 medium-3 columns">
                     <h5><a href="http://neo4j.com/contact-us">Contact Us &rarr;</a></h5>
                     <p>1-855-636-4532 <a href="mailto:info@neotechnology.com">US <i class="fi-mail"></i></a><br/> +44 808 189 0493 <a href="mailto:uk@neotechnology.com">UK <i class="fi-mail"></i></a><br/> +49 800 723 6231 <a href="mailto:vertrieb@neotechnology.com">Germany <i class="fi-mail"></i></a><br/> +33 (0)8 05 08 03 44 <a href="mailto:ventes@neotechnology.com">France <i class="fi-mail"></i></a></p>
                     <h5>Get Neo4j News</h5>
                     <p>Keep up with the latest graph database trends, tips &amp; events.</p>
                     <div class="row collapse">
                        <div class="small-9 columns">
                           <script src="//app-sjl.marketo.com/js/forms2/js/forms2.js"></script> 
                           <form id="mktoForm_477"></form>
                           <script>MktoForms2.loadForm("//app-sjl.marketo.com", "773-GON-065", 477);</script> 
                        </div>
                        <div class="small-3 columns"> <a href="#" id="signup" class="button postfix">Go &rsaquo;</a> </div>
                     </div>
                  </div>
               </div>
            </footer>
            <style> #mktoForm_477 button {display:none;} #mktoForm_477 {margin-left:-20px;} </style>
            <script>
               var btn = document.getElementById("signup");
               btn.onclick = function(){
                 MktoForms2.getForm(477).submit();
               };
            </script> 
            <div class="row text-center hide-for-small hr-style">
               <div class="medium-5 columns">
                  <hr>
               </div>
               <div class="medium-2 columns"> <object height="100%" width="100%" data="http://www.neo4j.com/wp-content/themes/neo4jzurb/assets/images/hr-image.svg" type="image/svg+xml"></object> </div>
               <div class="medium-5 columns">
                  <hr>
               </div>
            </div>
            <div class="row text-center show-for-small">
               <div class="medium-12 columns">
                  <hr>
               </div>
            </div>
            <div class="row collapse copyright">
               <div class="small-12 medium-3 columns text-center">
                  <p>&copy; 2014 <a href="http://neotechnology.com/">Neo Technology, Inc.</a></p>
               </div>
               <div class="small-12 medium-6 columns text-center">
                  <code>&#40;graphs&#41;-&#91;&#58;ARE&#93;-&rsaquo;&#40;everywhere&#41;</code> 
                  <p>With &hearts; from Sweden &amp; the <a href="http://neo4j.com/community/">Neo4j</a> Community</p>
               </div>
               <div class="small-12 medium-3 columns text-center">
                  <ul>
                     <li><a href="http://neo4j.com/terms">Terms</a></li>
                     <li><a href="http://neo4j.com/privacy-policy/">Privacy Policy</a></li>
                  </ul>
               </div>
            </div>
            <a class="exit-off-canvas"></a> 
         </div>
      </div>
      <script src="http://munchkin.marketo.net/munchkin.js" type="text/javascript"></script> <script type="text/javascript">mktoMunchkin("773-GON-065");</script> <script type='text/javascript' src='http://neo4j.com/wp-content/plugins/akismet/_inc/form.js?ver=3.0.1'></script> <script type='text/javascript' src='http://neo4j.com/wp-includes/js/jquery/jquery-migrate.min.js?ver=1.2.1'></script> <script type='text/javascript' src='http://cdnjs.cloudflare.com/ajax/libs/d3/3.4.2/d3.min.js?ver=3.9.2'></script> <script type='text/javascript' src='http://cdnjs.cloudflare.com/ajax/libs/json3/3.3.0/json3.min.js?ver=3.9.2'></script> <script type='text/javascript' src='http://neo4j.com/wp-content/themes/neo4jzurb/assets/js/neo_d3.js?ver=3.9.2'></script> <script type='text/javascript' src='http://neo4j.com/wp-includes/js/comment-reply.min.js?ver=3.9.2'></script> <script>
         jQuery(document).foundation({
           tab: {
             callback : function (tab) {
               $(window).trigger('resize');
             }
           }
         });
      </script> <script src="http://www.neo4j.com/wp-content/themes/neo4jzurb/assets/js/foundation/foundation.equalizer.js"></script> 
   </body>
   <script type="text/javascript" src="http://munchkin.marketo.net/munchkin.js"></script> <script type="text/javascript">
      mktoMunchkin("773-GON-065");
   </script> 
</html>
<!-- Dynamic page generated in 0.056 seconds. -->
<!-- Cached page generated by WP-Super-Cache on 2014-08-20 02:13:03 -->