= Graph Databases versus Relational Databases
:level: Intermediate
:toc:
:toc-placement!:
:toc-title: Overview
:toclevels: 1
:section: What is Neo4j

.Goals
[abstract]
This article explores the differences between relational and graph databases and data models.
In addition, it explains how to integrate graph databases with relational databases and how to import data from a relational store.

.Prerequisites
[abstract]
You should have looked into the link:../../what-is-neo4j/graph-database#property-graph[property-graph model] and into link:../../build-a-graph-data-model/guide-intro-to-graph-modeling[data modeling with graphs].

[role=expertise]
{level}

toc::[]

////
== TODO
* polyglot setup, integration with relational db's
* data import from relational (short section with link to data import)
* guides / tips for relational database developers / DBAs
////

=== Relational Databases

Relational databases have been (and continue to be) the power-horse of software applications since the 80s.
They store highly structured data in tables with predetermined columns of certain types and many rows of the same type of information, and, thanks in part to the rigidity of their organization, force developers and applications to strictly structure the data used in their applications.

In relational databases, references to other rows and tables are indicated by referring to their (primary-)key attributes, enforceable with constraints only when the connection is never optional.
Relationships are computed at query time by matching primary and foreign keys of the many (potentially indexed) rows of the to be joined tables.
These operations are CPU and RAM intensive and with an exponential cost.

image::http://dev.assets.neo4j.com.s3.amazonaws.com/wp-content/uploads/rel_graph4.jpg[]

If you use many-to-many relationships, you have to introduce a _JOIN_ table that lists foreign keys of both participating tables which further increases JOIN operation costs.
Those costly JOIN operations are usually addressed by denormalising data to reduce the number of JOINs necessary.

Although not every use-case is a good fit for this type of stringent data model, the lack of viable alternatives and the support for relational databases has made for the lack of well known alternatives has made it difficult for alternative models to break into the mainstream.

Meet graph databases.

=== From Relational to Graph Databases

Relationships are first-class citizens of the graph data model, unlike other database management systems, which require us to infer connections between entities using contrived properties such as foreign keys, or out-of-band processing like map-reduce. 
By assembling the simple abstractions of nodes and relationships into connected structures, graph databases enable us to build arbitrarily sophisticated models that map closely to our problem domain.

In some regards, graph databases are like the next generation of relational databases, but with first class support for "relationships", or those implicit connections indicated via foreign-keys in the traditional relational databases.

Each node (entity or attribute) in the graph database model directly contains a list of relationship-records that represent its relationships to other nodes, organized by type and direction and holding additional attributes.
Whenever you run the equivalent of a  _JOIN_ operation, the database walks this list and has direct access to the connected nodes, eliminating the need for a costly search / match computation.

The resulting models are simpler and at the same time more expressive than those produced using traditional relational databases and the other NOSQL stores.

image::http://dev.assets.neo4j.com.s3.amazonaws.com/wp-content/uploads/rel_graph5.jpg[]

Unlike other NoSQL databases, graph databases support a very flexible and fine-grained data model that allows you to model and manage rich domains in an easy and intuitive way.

You more or less keep the data as it is in the real world: small, normalized, yet richly connected entities.
This allows you to query and view your data from any imaginable view point, supporting many different use-cases.
 
The fine grained model also means that there is no natural boundary around aggregates, so the scope of update operations has to be provided by the application.
The well-known and tested concept of transactions groups a set of updates of nodes and relationships into a atomic, consistent, isolated, and durable (ACID) operation.
Graph databases like Neo4j fully support the transactional concepts including write ahead logs and recovery after abnormal termination.

image::http://dev.assets.neo4j.com.s3.amazonaws.com/wp-content/uploads/rel_graph9.jpg[]

If you're used to modeling with relational databases, try to remember the ease and beauty of good, normalized entity-relationship diagram: a simple, easy to understand model you can quickly whiteboard with your colleagues and domain experts.

Let's take a realistic model of an organizational domain and show how it would be modeled in a relational database vs. the graph database:

image::http://dev.assets.neo4j.com.s3.amazonaws.com/wp-content/uploads/domain.png[]

[role=side-nav]
=== Recommended

* link:../graph-database["What is a Graph Database"]
* https://vimeo.com/103466968["Intro to Neo4j"^,role=webinar]
* http://neo4j.com/events?type=Training["Neo4j Training",role=event]

=== Graph Querying with Cypher

Querying relational databases is easy with SQL, a declarative query language allows both for easy ad-hoc querying in a database tool as well as specifying use-case related queries in your code.
Even object-relational mappers use SQL under the hood to talk to the database.

Do graph databases have something similar?
Cypher, Neo4j's declarative graph query language, is built on the basic concepts and clauses of SQL but added a lot of graph-specific functionality to make it simple to work with your rich graph model without being too verbose.

If you have ever tried to write a SQL statement with a large number of JOINs, you know that you quickly lose sight of what the query actually does due to all the technical noise.

In the organizational domain described in the image above, what would a SQL statement that lists the _employees in the "IT Department"_ look like, and how does that statement compare to a Cypher statement?

// sum of the weekly work hours of employees of "GraphIT" working in the different projects

.SQL Statement
[source,sql]
----
SELECT * FROM Person
LEFT JOIN Person_Department
  ON Person.Id = Person_Department.PersonId
LEFT JOIN Department
  ON Department.Id = Person_Department.DepartmentId
WHERE Department.name = "IT Department"
----

.Cypher Statement
[source,cypher]
----
MATCH (p:Person)<-[:EMPLOYEE]-(d:Dept {name:"IT Department"})
RETURN p.name, d.name
----

[role=side-nav]
=== Recommended

* link:/online-training[Online Training]
* link:../../cypher-query-language[Quick Cypher Intro]
* link:/use-cases[Use-Case Examples]
* {manual}/examples-from-sql-to-cypher.html[Manual: From SQL to Cypher]

=== Connecting to Neo4j

If you've installed and started Neo4j as a server on your system, you can interact with the database with the built-in Neo4j browser application.

If you want to access Neo4j programmatically, you can do so with one of the many integrated HTTP APIs, which allow you to:

* POST one or more cypher statements with parameters per request to the server
* Keep transactions open over multiple requests
* Choose different result formats

A sample HTTP request would look like:

[source,json]
----
curl -i -H accept:application/json -H content-type:application/json \
-XPOST http://localhost:7474/db/data/transaction/commit \
  -d '{"statements":[{"statement":"CREATE (p:Person {name:{name}}) RETURN p",
       "parameters":{"name":"Daniel"}}]}'

{"results":[{"columns":["p"],"data":[{"row":[{"name":"Daniel"}]}]}],"errors":[]}
----

In most cases you don't want to connect to Neo4j manually, but with a driver or connector library designed for your stack or programming language.
Thanks to the Neo4j community, there are drivers for Neo4j for almost every popular programming language, most of which mimic existing database driver idioms and approaches.

For instance, the Neo4j JDBC driver would be used like this:

[source,java]
----
Connection con = DriverManager.getConnection("jdbc:neo4j://localhost:7474/");

String query =
    "MATCH (:Person {name:{1}})-[:EMPLOYEE]-(d:Dept) RETURN d.name as dept";
try (PreparedStatement stmt = con.prepareStatement(QUERY)) {
    stmt.setString(1,"John");
    ResultSet rs = stmt.executeQuery();
    while(rs.next()) {
        String department = rs.getString("dept");
        ....
    }
}
----

[role=side-nav]
=== Recommended

* link:/download[Install Neo4j]
* link:../../language-guides[Develop with Neo4j]
* link:../../language-guides/java/jdbc[JDBC example]
* {manual}/rest-api-transactional.html[Cypher HTTP Endpoint,role=docs]

=== Importing Data from a Relational Database

If you have a good understanding what your graph model should look like, i.e. what data will be represented as nodes or relationships and how the labels, relationship-types, and attributes are named, you're ready to go.

The easiest way to import data from your relational database is to create a CSV dump of either individual tables and JOIN-tables or of a JOINed, denormalized representation.

Then you can take the CSV file and use Cypher's `LOAD CSV` power tool to:

* Ingest the data, accessing columns by header name or offset
* Convert values from strings to different formats and structures (`toFloat`, `split`, ...)
* Skip rows to ignore
* `MATCH` nodes based on attribute lookups
* `CREATE` or `MERGE` nodes and relationships with labels and attributes from the row data

For Example:

.persons.csv
[source,csv]
----
name;email;dept
"Lars Higgs";"lars@higgs.com";"IT-Department"
"Maura Wilson";"maura@wilson.com";"Procurement"
----

[source,cypher]
----
LOAD CSV FROM 'file:///data/persons.csv' WITH HEADERS AS line
FIELDTERMINATOR ";"
MERGE (person:Person {email: line.email}) ON CREATE SET p.name = line.name
MATCH (dep:Department {name:line.dept})
CREATE (person)-[:EMPLOYEE]->(dept)
----

You can import multiple CSV files from one or more data sources to enrich your core domain model with other information that might add interesting insights and capabilities.

[role=side-nav]
=== Recommended

* link:../../working-with-data/guide-importing-data-and-etl["Data Import",role=guide]
* {manual}/query-load-csv.html["LOAD CSV",role=docs]
* http://watch.neo4j.org/video/90358900["Data Import Webinar",role=video]
* http://jexp.de/blog/2014/06/load-csv-into-neo4j-quickly-and-successfully/["LOAD CSV Tips",role=blog]
* http://worldcup.neo4j.org/the-world-cup-graph-domain-model/["World Cup Dataset",role=blog]

// === Keeping Neo4j in Sync with a Relational Database
